handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/system_n32g05x.c
/**
*     Copyright (c) 2023, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file system_n32g05x.c
*\*\author Nations
*\*\version v1.1.0
*\*\copyright Copyright (c) 2023, Nations Technologies Inc. All rights reserved.
 */
#include "n32g05x.h"

/* Uncomment the line corresponding to the desired System clock (SYSCLK)
   frequency (after reset the HSI is used as SYSCLK source)

   IMPORTANT NOTE:
   ==============
   1. After each device reset the HSI is used as System clock source.

   2. Please make sure that the selected System clock doesn't exceed your
   device's maximum frequency.

   3. If none of the define below is enabled, the HSI is used as System clock
    source.

   4. The System clock configuration functions provided within this file assume
   that:
        - For Low and High density Value line devices an external 8MHz
          crystal is used to drive the System clock.
        - For Low and High density devices an external 8MHz crystal is
          used to drive the System clock.
        - For Connectivity line devices an external 25MHz crystal is used to
   drive the System clock. If you are using different crystal you have to adapt
   those functions accordingly.
    */

#define SYSCLK_USE_HSI     0
#define SYSCLK_USE_HSE     1
#define SYSCLK_USE_HSI_PLL 2
#define SYSCLK_USE_HSE_PLL 3
#define SYSCLK_USE_LSI     4

#ifndef SYSCLK_FREQ
#define SYSCLK_FREQ 64000000
#endif

/*
* SYSCLK_SRC *
** SYSCLK_USE_HSI     **
** SYSCLK_USE_HSE     **
** SYSCLK_USE_HSI_PLL **
** SYSCLK_USE_HSE_PLL **
** SYSCLK_USE_LSI     **
*/
#ifndef SYSCLK_SRC
#define SYSCLK_SRC SYSCLK_USE_HSI_PLL
#endif

#if SYSCLK_SRC == SYSCLK_USE_HSI

    #ifndef HSI_VALUE
        #error HSI_VALUE must be defined!
    #endif

    #if SYSCLK_FREQ != HSI_VALUE
        #error SYSCL_FREQ must be set to HSI_VALUE
    #endif

#elif SYSCLK_SRC == SYSCLK_USE_HSE

    #ifndef HSE_VALUE
        #error HSE_VALUE must be defined!
    #endif

    #if SYSCLK_FREQ != HSE_VALUE
        #error SYSCL_FREQ must be set to HSE_VALUE
    #endif

#elif SYSCLK_SRC == SYSCLK_USE_HSI_PLL || SYSCLK_SRC == SYSCLK_USE_HSE_PLL
	
		#if SYSCLK_SRC == SYSCLK_USE_HSI_PLL
				#ifndef HSI_VALUE
						#error HSI_VALUE must be defined!
				#endif
				#define PLLSRC_VALUE  HSI_VALUE
		#elif SYSCLK_SRC == SYSCLK_USE_HSE_PLL
				#ifndef HSE_VALUE
				    #error HSE_VALUE must be defined!
				#endif
				#define PLLSRC_VALUE  HSE_VALUE
		#endif 
		
    #if ((SYSCLK_FREQ * 1) >= 48000000) && ((SYSCLK_FREQ * 1) <= 72000000)
        #if ( ((PLLSRC_VALUE / 1) >= 4000000) && ((PLLSRC_VALUE / 1) <= 16000000) && ((PLLSRC_VALUE % 1) == 0) )\
            && ( (((SYSCLK_FREQ * 1) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 1) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 1) % PLLSRC_VALUE) == 0) )
                #define PLL_MUL    (SYSCLK_FREQ * 1 / PLLSRC_VALUE)
                #define PLL_PRE    0
				#define PLLOUT_DIV 0
                #define SYSCLK_CONFIG_PASS
				#elif ( ((PLLSRC_VALUE / 2) >= 4000000) && ((PLLSRC_VALUE / 2) <= 16000000) && ((PLLSRC_VALUE % 2) == 0) )\
						&& ( (((SYSCLK_FREQ * 2) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 2) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 2) % PLLSRC_VALUE) == 0) )
								#define PLL_MUL    (SYSCLK_FREQ * 2 / PLLSRC_VALUE)
								#define PLL_PRE    1
								#define PLLOUT_DIV 0
								#define SYSCLK_CONFIG_PASS
				#elif ( ((PLLSRC_VALUE / 3) >= 4000000) && ((PLLSRC_VALUE / 3) <= 16000000) && ((PLLSRC_VALUE % 3) == 0) )\
						&& ( (((SYSCLK_FREQ * 3) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 3) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 3) % PLLSRC_VALUE) == 0) )
								#define PLL_MUL    (SYSCLK_FREQ * 3 / PLLSRC_VALUE)
								#define PLL_PRE    2
								#define PLLOUT_DIV 0
								#define SYSCLK_CONFIG_PASS
				#elif ( ((PLLSRC_VALUE / 4) >= 4000000) && ((PLLSRC_VALUE / 4) <= 16000000) && ((PLLSRC_VALUE % 4) == 0) )\
						&& ( (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 4) % PLLSRC_VALUE) == 0) )
								#define PLL_MUL    (SYSCLK_FREQ * 4 / PLLSRC_VALUE)
								#define PLL_PRE    3
								#define PLLOUT_DIV 0
								#define SYSCLK_CONFIG_PASS
        #endif
    #endif
    
    #ifndef SYSCLK_CONFIG_PASS
        #if ((SYSCLK_FREQ * 2) >= 48000000) && ((SYSCLK_FREQ * 2) <= 72000000)          
            #if ( ((PLLSRC_VALUE / 1) >= 4000000) && ((PLLSRC_VALUE / 1) <= 16000000) && ((PLLSRC_VALUE % 1) == 0) )\
                && ( (((SYSCLK_FREQ * 2) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 2) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 2) % PLLSRC_VALUE) == 0) )
                    #define PLL_MUL    (SYSCLK_FREQ * 2 / PLLSRC_VALUE)
                    #define PLL_PRE    0
					#define PLLOUT_DIV 1
                    #define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 2) >= 4000000) && ((PLLSRC_VALUE / 2) <= 16000000) && ((PLLSRC_VALUE % 2) == 0) )\
								&& ( (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 4) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 4 / PLLSRC_VALUE)
										#define PLL_PRE    1
										#define PLLOUT_DIV 1
										#define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 3) >= 4000000) && ((PLLSRC_VALUE / 3) <= 16000000) && ((PLLSRC_VALUE % 3) == 0) )\
								&& ( (((SYSCLK_FREQ * 6) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 6) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 6) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 6 / PLLSRC_VALUE)
										#define PLL_PRE    2
										#define PLLOUT_DIV 1
										#define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 4) >= 4000000) && ((PLLSRC_VALUE / 4) <= 16000000) && ((PLLSRC_VALUE % 4) == 0) )\
								&& ( (((SYSCLK_FREQ * 8) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 8) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 8) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 8 / PLLSRC_VALUE)
										#define PLL_PRE    3
										#define PLLOUT_DIV 1
										#define SYSCLK_CONFIG_PASS                          
             #endif
         #endif
     #endif
    
    #ifndef SYSCLK_CONFIG_PASS
        #if ((SYSCLK_FREQ * 3) >= 48000000) && ((SYSCLK_FREQ * 3) <= 72000000)           
            #if ( ((PLLSRC_VALUE / 1) >= 4000000) && ((PLLSRC_VALUE / 1) <= 16000000) && ((PLLSRC_VALUE % 1) == 0) )\
                && ( (((SYSCLK_FREQ * 3) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 3) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 3) % PLLSRC_VALUE) == 0) )
                    #define PLL_MUL    (SYSCLK_FREQ * 3 / PLLSRC_VALUE)
                    #define PLL_PRE    0
					#define PLLOUT_DIV 2
                    #define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 2) >= 4000000) && ((PLLSRC_VALUE / 2) <= 16000000) && ((PLLSRC_VALUE % 2) == 0) )\
								&& ( (((SYSCLK_FREQ * 6) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 6) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 6) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 6 / PLLSRC_VALUE)
										#define PLL_PRE    1
										#define PLLOUT_DIV 2
										#define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 3) >= 4000000) && ((PLLSRC_VALUE / 3) <= 16000000) && ((PLLSRC_VALUE % 3) == 0) )\
								&& ( (((SYSCLK_FREQ * 9) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 9) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 9) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 9 / PLLSRC_VALUE)
										#define PLL_PRE    2
										#define PLLOUT_DIV 2
										#define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 4) >= 4000000) && ((PLLSRC_VALUE / 4) <= 16000000) && ((PLLSRC_VALUE % 4) == 0) )\
								&& ( (((SYSCLK_FREQ * 12) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 12) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 12) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 12 / PLLSRC_VALUE)
										#define PLL_PRE    3
										#define PLLOUT_DIV 2
										#define SYSCLK_CONFIG_PASS                   
            #endif
         #endif
     #endif
    
   #ifndef SYSCLK_CONFIG_PASS
       #if ((SYSCLK_FREQ * 4) >= 48000000) && ((SYSCLK_FREQ * 4) <= 72000000)            
           #if  (((PLLSRC_VALUE / 1) >= 4000000) && ((PLLSRC_VALUE / 1) <= 16000000) && ((PLLSRC_VALUE % 1) == 0) \
					 && (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 4) % PLLSRC_VALUE) == 0) )
                    #define PLL_MUL    (SYSCLK_FREQ * 4 / PLLSRC_VALUE)
                    #define PLL_PRE    0
					#define PLLOUT_DIV 3
                    #define SYSCLK_CONFIG_PASS
           #elif (((PLLSRC_VALUE / 2) >= 4000000) && ((PLLSRC_VALUE / 2) <= 16000000) && ((PLLSRC_VALUE % 2) == 0)  \
					 && (((SYSCLK_FREQ * 8) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 8) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 8) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 8 / PLLSRC_VALUE)
										#define PLL_PRE    1
										#define PLLOUT_DIV 3
										#define SYSCLK_CONFIG_PASS
           #elif  (((PLLSRC_VALUE / 3) >= 4000000) && ((PLLSRC_VALUE / 3) <= 16000000) && ((PLLSRC_VALUE % 3) == 0) \
					 && (((SYSCLK_FREQ * 12) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 12) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 12) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 12 / PLLSRC_VALUE)
										#define PLL_PRE    2
										#define PLLOUT_DIV 3
										#define SYSCLK_CONFIG_PASS
           #elif  (((PLLSRC_VALUE / 4) >= 4000000) && ((PLLSRC_VALUE / 4) <= 16000000) && ((PLLSRC_VALUE % 4) == 0) \
					 && (((SYSCLK_FREQ * 16) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 16) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 16) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 16 / PLLSRC_VALUE)
										#define PLL_PRE    3
										#define PLLOUT_DIV 3
										#define SYSCLK_CONFIG_PASS                          
           #endif
       #endif
   #endif
     
	 #ifndef SYSCLK_CONFIG_PASS
			 #error Cannot make a PLL multiply factor to SYSCLK_FREQ.
	 #endif
		 

#elif SYSCLK_SRC == SYSCLK_USE_LSI

    #ifndef LSI_VALUE
        #error LSI_VALUE must be defined!
    #endif

    #if SYSCLK_FREQ != LSI_VALUE
        #error SYSCL_FREQ must be set to LSI_VALUE
    #endif

#else
#error wrong value for SYSCLK_SRC
#endif

