handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/system_n32g05x.c
/* #define VECT_TAB_SRAM */
#define VECT_TAB_OFFSET 0x0 /*!< Vector Table base offset field. This value must be a multiple of 0x200. */

/*******************************************************************************
 *  Clock Definitions
 *******************************************************************************/
uint32_t SystemCoreClock = SYSCLK_FREQ; /*!< System Clock Frequency (Core Clock) */

static void SetSysClock(void);

#ifdef DATA_IN_ExtSRAM
static void SystemInit_ExtMemCtl(void);
#endif /* DATA_IN_ExtSRAM */

/**
*\*\name SystemInit
*\*\fun  Setup the microcontroller system
*\*\         Initialize the Embedded Flash Interface, the PLL and update the
*\*\         SystemCoreClock variable.
*\*\param  none
*\*\return  none
*\*\note   This function should be used only after reset.
 */
void SystemInit(void)
{
    uint32_t temp_value;

    temp_value = PWR->CTRL3;
    /* Clear NRSTCNT[10:0] bits */
    temp_value &= (~(PWR_CTRL3_NRSTCNT));
    /* Set the NRSTCNT[10:0] bits according to filter_value */
    temp_value |= (uint32_t)0x7FF << 16; 
    /* Store the new value */
    PWR->CTRL3 = temp_value;
    /* Enables or disables the NRST pin Filter. */
    PWR->CTRL3 |= PWR_CTRL3_NRSTFILEN;
    /* Reset the RCC clock configuration to the default reset state(for debug purpose) */
    /* Set HSIEN bit */
    RCC->CTRL |= (uint32_t)0x00000001U;

    /* Reset SCLKSW, AHBPRE, APB1PRES, APB2PRES, MCO and MCOPRES bits */
    RCC->CFG &= (uint32_t)0x21FF0000U;

    /* Reset HSEON, CLKSSEN and PLLEN bits */
    RCC->CTRL &= (uint32_t)0xFEF6FFFFU;
  
    /* Reset PLLBP bit */
    RCC->CTRL &= (uint32_t)0xFFBFFFFFU;

    /* Reset PLLMULFCT, PLLPRE, PLLOUTDIV and PLLSRC bits */
    RCC->CFG &= (uint32_t)0xFE00FFFFU;

    /* Reset CFG2 register */
    RCC->CFG2 = 0x00003800U;

    /* Disable all interrupts and clear pending bits  */
    RCC->CLKINT = 0x00BD0000U;

    /* Enable Prefetch Buffer */
    FLASH->AC |= (uint32_t)FLASH_AC_PRFTBFEN;
    
    /* Configure the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers */
    /* Configure the Flash Latency cycles and enable prefetch buffer */
    SetSysClock();
}

/**
*\*\name    RCC_ClrIntPendingBit.
*\*\fun  Update SystemCoreClock variable according to Clock Register Values.
*\*\        The SystemCoreClock variable contains the core clock (HCLK), it can
*\*\        be used by the user application to setup the SysTick timer or configure other parameters.
*\*\param  none
*\*\return  none
*\*\note   Each time the core clock (HCLK) changes, this function must be called
*\*\        to update SystemCoreClock variable value. Otherwise, any configuration based on this variable will be incorrect.
*\*\note   - The system frequency computed by this function is not the real
*\*\          frequency in the chip. It is calculated based on the predefined constant and the selected clock source:
*\*\          - If SYSCLK source is HSI, SystemCoreClock will contain the HSI_VALUE(*)
*\*\          - If SYSCLK source is HSE, SystemCoreClock will contain the HSE_VALUE(**)
*\*\          - If SYSCLK source is PLL, SystemCoreClock will contain the HSE_VALUE(**) or HSI_VALUE(*) multiplied by the PLL factors.
*\*\          - If SYSCLK source is LSI, SystemCoreClock will contain the LSI_VALUE(***)
*\*\        (*) HSI_VALUE is a constant defined in n32g05x.h file (default value
*\*\            8 MHz) but the real value may vary depending on the variations
*\*\            in voltage and temperature.
*\*\        (**) HSE_VALUE is a constant defined in n32g05x.h file (default value
*\*\             8 MHz, depedning on the product used), user has to
*\*\             ensure that HSE_VALUE is same as the real frequency of the crystal used.
*\*\             Otherwise, this function may have wrong result.
*\*\        (***) LSI_VALUE is a constant defined in n32g05x.h file (default value
*\*\            32KHz) but the real value may vary depending on the variations
*\*\            in voltage and temperature.
*\*\        - The result of this function could be not correct when using
*\*\fractional value for HSE crystal.
 */
void SystemCoreClockUpdate(void)
{
    uint32_t tmp, pllmull, pllpre, plloutdiv, pllsource;
    const uint8_t AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

    /* Get SYSCLK source
     * -------------------------------------------------------*/
    tmp = RCC->CFG & RCC_CFG_SCLKSTS;

    switch (tmp)
    {
        case RCC_CFG_SCLKSTS_HSI: /* HSI used as system clock */
            SystemCoreClock = HSI_VALUE;
            break;
        case RCC_CFG_SCLKSTS_HSE: /* HSE used as system clock */
            SystemCoreClock = HSE_VALUE;
            break;
        case RCC_CFG_SCLKSTS_PLL: /* PLL used as system clock */

            /* Get PLL clock source, PLL Pre-Divider, PLL out div and multiplication factor ----------------------*/
            pllmull   = RCC->CFG & RCC_CFG_PLLMULFCT;
            pllpre    = RCC->CFG & RCC_CFG_PLLPRE;
            plloutdiv = RCC->CFG & RCC_CFG_PLLOUTDIV;
            pllsource = RCC->CFG & RCC_CFG_PLLSRC;
        
            pllmull = (pllmull >> 16) + 3;
        
            if ((pllsource >> 24) == 0x00)
            { 
                /* HSI selected as PLL clock entry */
                SystemCoreClock = HSI_VALUE * pllmull;
            }
            else
            {
                /* HSE selected as PLL clock entry */
                SystemCoreClock = HSE_VALUE * pllmull;
            }
            
            /* PLL Pre-Divider clock */
            pllpre = (pllpre >> 20) + 1;
            SystemCoreClock = SystemCoreClock / pllpre;

            /* PLL Out Div clock */
            plloutdiv = (plloutdiv >> 22) + 1;
            SystemCoreClock = SystemCoreClock / plloutdiv;
            break;
            
        case RCC_CFG_SCLKSTS_LSI: /* LSI used as system clock */
            SystemCoreClock = LSI_VALUE;
            break;

        default:
            SystemCoreClock = HSI_VALUE;
            break;
    }

    /* Compute HCLK clock frequency ----------------*/
    /* Get HCLK prescaler */
    tmp = AHBPrescTable[((RCC->CFG & RCC_CFG_AHBPRES) >> 4)];
    /* HCLK clock frequency */
    SystemCoreClock >>= tmp;
}

/**
*\*\name    HSE_Frequency_Detection
*\*\fun     Used to check if HSE has started vibrating normally.
*\*\param   none
*\*\return  HSE status
 */
uint32_t HSE_Frequency_Detection(void)
{
    uint32_t status = 1U;
    uint32_t tmpccmodx ;
    uint32_t tmpccen , tmp = 0U ;
    uint32_t timeoutcnt = 90000,HSE_FREQ =0U;
    uint8_t i=0U;
    uint32_t HSE_FREQ_TEMP[22];
    uint32_t HSE_valuetemp = 0U;
    uint32_t HSE_valuedown,HSE_valueup;
    
    HSE_valuedown = (HSE_VALUE - HSE_VALUE/10)/1000;
    HSE_valueup = (HSE_VALUE + HSE_VALUE/10)/1000;
    
    RCC->APB2PCLKEN |= RCC_APB2PCLKEN_TIM2EN;
    TIM2->CTRL1 |= 0x00080000;
   
    /*---------Configure the TI4 as Input------------*/
    /* Disable the Channel 4: Reset the CC4E Bit */
    TIM2->CCEN &= (uint32_t)(~((uint32_t)0x00004000U));
    tmpccmodx = TIM2->CCMOD2;
    tmpccen  = TIM2->CCEN;
    /* Select the Input and set the filter */
    tmpccmodx &= (uint32_t)((uint16_t)(~(uint16_t)0x00000300U) & ((uint16_t) ~((uint16_t)0x0000F000U)));
    tmpccmodx |= (uint32_t)(0x00000001 << 8);

    /* Select the Polarity and set the CC4E Bit */
    tmpccen &= (uint32_t)(~((uint32_t)(0x00008000U)));
    tmpccen |= (uint32_t)(tmp | (uint32_t)0x00004000U);

    /* Write to TIM2 CCMOD2 and CCEN registers */
    TIM2->CCMOD2 = tmpccmodx;
    TIM2->CCEN   = tmpccen;
    
    /*---------Sets the TIMx Input Capture 4 prescaler.------------*/
    /* Reset the IC4PSC Bits */
    TIM2->CCMOD2 &= (uint32_t)(~((uint16_t)0x00000C00U));
    
    /* Enable the TIM Counter */
    TIM2->CTRL1 |= (uint32_t)0x00000001U;
    
    while(timeoutcnt)//timeoutcnt>0
    {
        IWDG->KEY = (uint32_t)0xAAAA;
        timeoutcnt--;
        if(TIM2->STS & 0x08)
        {
            TIM2->STS = 0;
            HSE_FREQ_TEMP[i] = TIM2->CCDAT4;
            i++;
            
            if(i>=21)
            {
                HSE_FREQ = 0;
                for(i=1;i<21;i++)
                {
                    if(HSE_FREQ_TEMP[i] > HSE_FREQ_TEMP[i-1])
                    {
                        HSE_FREQ += (HSE_FREQ_TEMP[i] - HSE_FREQ_TEMP[i-1]);
                    }
                    else
                    {
                        HSE_FREQ += (65536 + HSE_FREQ_TEMP[i] - HSE_FREQ_TEMP[i-1]);
                    }
                }
                HSE_valuetemp = 8000*128*20/HSE_FREQ;
                
                if((HSE_valuetemp <= HSE_valueup) && (HSE_valuetemp >= HSE_valuedown))
                {
                    break;
                }
                else
                {
                    i = 0;
                }
            }
        }
    }
    
