handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/system_n32g05x.c
    if(timeoutcnt==0)
    {
        status = 0U;
    }
    
    /* RESET the TIM2 */
    TIM2->CTRL1 = (uint32_t)0x00000000U;
    RCC->APB2PRST |= RCC_APB2PCLKEN_TIM2EN;
    RCC->APB2PRST &= ~RCC_APB2PCLKEN_TIM2EN;
    RCC->APB2PCLKEN &= ~RCC_APB2PCLKEN_TIM2EN;
    
    return status;
}

/**
*\*\name    HSEPLL_Failed_Detection
*\*\fun     Solution to PLL clock domain anomaly caused by HSE clock abnormality.
*\*\param   none
*\*\return  none
 */
void HSEPLL_Failed_Detection(void)
{
	uint32_t temp_value;
	if((RCC->CTRL & RCC_CTRL_PLLEN) == RCC_CTRL_PLLEN)
	{
		*(uint32_t*)0x4002101C |= 0x10000000U;
		*(uint32_t*)0x4000702C = 0x33000;
		*(uint32_t*)0x4000702C |= 0x10;
		*(uint32_t*)0x40007024 |= 0x10;
		temp_value = *(uint32_t*)0x40007024;
		temp_value &= 0xFFFFFFF3;
		temp_value |= 0x08;
		*(uint32_t*)0x40007024 = temp_value;
		
		temp_value = *(uint32_t*)0x40007028;
		temp_value &= 0xFFFFFFF3;
		temp_value |= 0x0C;
		*(uint32_t*)0x40007028 = temp_value;
		
		temp_value = *(uint32_t*)0x40007000;
		temp_value &= (~0x00000002U);
		*(uint32_t*)0x40007000 = temp_value;
		*(uint32_t*)0xE000ED10 |= 0x00000004U;
		__WFI();
		*(uint32_t*)0xE000ED10 &= (~0x00000004U);
		while(1);
	}
	else
	{
		/* no process */
	}
}

/**
*\*\name  SetSysClock.
*\*\fun   Configures the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers.
*\*\param  none
*\*\return  none
**/
static void SetSysClock(void)
{
    uint32_t rcc_cfg        = 0;
#if ((SYSCLK_SRC == SYSCLK_USE_HSI) || (SYSCLK_SRC == SYSCLK_USE_HSI_PLL))

    uint32_t HSIStatus;
	uint32_t StartUpCounter = 0;
	
#elif ((SYSCLK_SRC == SYSCLK_USE_HSE) || (SYSCLK_SRC == SYSCLK_USE_HSE_PLL))

    uint32_t HSEStatus;
#elif (SYSCLK_SRC == SYSCLK_USE_LSI)

    uint32_t LSIStatus;
	uint32_t StartUpCounter = 0;
#endif
	
	HSEPLL_Failed_Detection();

#if ((SYSCLK_SRC == SYSCLK_USE_HSI) || (SYSCLK_SRC == SYSCLK_USE_HSI_PLL))

    /* Enable HSI */
    RCC->CTRL |= ((uint32_t)RCC_CTRL_HSIEN);

    /* Wait till HSI is ready and if Time out is reached exit */
    do
    {
        HSIStatus = RCC->CTRL & RCC_CTRL_HSIRDF;
        StartUpCounter++;
    } while ((HSIStatus == 0) && (StartUpCounter != HSI_STARTUP_TIMEOUT));

    if((RCC->CTRL & RCC_CTRL_HSIRDF) != RESET)
    {
        HSIStatus = (uint32_t)0x1;
    }
    else
    {
        HSIStatus = (uint32_t)0x0;
    }
    
    if (HSIStatus == 0)
    {
        /* If HSI fails to start-up, the application will have wrong clock
         * configuration. User can add here some code to deal with this error */
        while(1);
    }

#elif ((SYSCLK_SRC == SYSCLK_USE_HSE) || (SYSCLK_SRC == SYSCLK_USE_HSE_PLL))

    /* Enable HSE */
    RCC->CTRL |= (uint32_t)RCC_CTRL_HSEEN;
    
    /* Wait till HSE is ready and if Time out is reached exit */
    HSEStatus = HSE_Frequency_Detection();
    
    if (HSEStatus == 0)
    {
        /* If HSE fails to start-up, the application will have wrong clock
         * configuration. User can add here some code to deal with this error */
        SystemCoreClock = HSI_VALUE;
        return;
    }

#elif (SYSCLK_SRC == SYSCLK_USE_LSI)

    /* Enable LSI */
    RCC->LSCTRL |= ((uint32_t)RCC_LSCTRL_LSIEN);

    /* Wait till LSI is ready and if Time out is reached exit */
    do
    {
        LSIStatus = RCC->LSCTRL & RCC_LSCTRL_LSIRD;
        StartUpCounter++;
    } while ((LSIStatus == 0) && (StartUpCounter != LSI_STARTUP_TIMEOUT));

    if((RCC->LSCTRL & RCC_LSCTRL_LSIRD) != RESET)
    {
        LSIStatus = (uint32_t)0x1;
    }
    else
    {
        LSIStatus = (uint32_t)0x0;
    }
    
    if (LSIStatus == 0)
    {
        /* If LSI fails to start-up, the application will have wrong clock
         * configuration. User can add here some code to deal with this error */
        SystemCoreClock = HSI_VALUE;
        return;
    }

#endif

    /* Flash wait state
        0: SYSCLK <= 24M
        1: SYSCLK <= 48M
        2: SYSCLK <= 64M
     */
    FLASH->AC &= (uint32_t)((uint32_t)~FLASH_AC_LATENCY);
    FLASH->AC |= (uint32_t)((SYSCLK_FREQ - 1) / 24000000);

    /* HCLK = SYSCLK */
    RCC->CFG |= (uint32_t)RCC_CFG_AHBPRES_DIV1;

    /* PCLK2 = HCLK */
    RCC->CFG |= (uint32_t)RCC_CFG_APB2PRES_DIV1;
    

    /* PCLK1 = HCLK/2 */
    RCC->CFG |= (uint32_t)RCC_CFG_APB1PRES_DIV2;
    
    
#if SYSCLK_SRC == SYSCLK_USE_HSI
    /* Select HSI as system clock source */
    RCC->CFG &= (uint32_t)((uint32_t) ~(RCC_CFG_SCLKSW));
    RCC->CFG |= (uint32_t)RCC_CFG_SCLKSW_HSI;

    /* Wait till HSI is used as system clock source */
    while ((RCC->CFG & (uint32_t)RCC_CFG_SCLKSTS) != RCC_CFG_SCLKSTS_HSI)
    {
    }
#elif SYSCLK_SRC == SYSCLK_USE_HSE
    /* Select HSE as system clock source */
    RCC->CFG &= (uint32_t)((uint32_t) ~(RCC_CFG_SCLKSW));
    RCC->CFG |= (uint32_t)RCC_CFG_SCLKSW_HSE;

    /* Wait till HSE is used as system clock source */
    while ((RCC->CFG & (uint32_t)RCC_CFG_SCLKSTS) != RCC_CFG_SCLKSTS_HSE)
    {
    }
#elif SYSCLK_SRC == SYSCLK_USE_HSI_PLL || SYSCLK_SRC == SYSCLK_USE_HSE_PLL
		
    /* clear bits */
    /* Clear PLLOUTDIV PLLPRE bits */
    RCC->CFG &= (~RCC_CFG_PLLOUTDIV);
    
    RCC->CFG &= (uint32_t)((uint32_t) ~(RCC_CFG_PLLSRC | RCC_CFG_PLLPRE | RCC_CFG_PLLMULFCT));

    /* set PLL source */
    rcc_cfg = RCC->CFG;
    rcc_cfg |= ((SYSCLK_SRC == SYSCLK_USE_HSI_PLL) ? RCC_CFG_PLLSRC_HSI : RCC_CFG_PLLSRC_HSE);

    /* set PLL multiply factor */
    rcc_cfg |= (((uint32_t)PLL_MUL - 3) << 16);
    /* set PLL Pre-Divider factor */
    rcc_cfg |= ((uint32_t)PLL_PRE << 20);
    /* set PLL output clock divider factor */
    rcc_cfg |= ((uint32_t)PLLOUT_DIV << 22);

    RCC->CFG = rcc_cfg;

    /* Enable PLL */
    RCC->CTRL |= RCC_CTRL_PLLEN;

    /* Wait till PLL is ready */
    while ((RCC->CTRL & RCC_CTRL_PLLRDF) == 0)
    {
    }

    /* Select PLL as system clock source */
    RCC->CFG &= (uint32_t)((uint32_t) ~(RCC_CFG_SCLKSW));
    RCC->CFG |= (uint32_t)RCC_CFG_SCLKSW_PLL;

    /* Wait till PLL is used as system clock source */
    while ((RCC->CFG & (uint32_t)RCC_CFG_SCLKSTS) != (uint32_t)RCC_CFG_SCLKSTS_PLL)
    {
    }
#elif SYSCLK_SRC == SYSCLK_USE_LSI
    /* Select LSI as system clock source */
    RCC->CFG &= (uint32_t)((uint32_t) ~(RCC_CFG_SCLKSW));
    RCC->CFG |= (uint32_t)RCC_CFG_SCLKSW_LSI;

    /* Wait till LSI is used as system clock source */
    while ((RCC->CFG & (uint32_t)RCC_CFG_SCLKSTS) != RCC_CFG_SCLKSTS_LSI)
    {
    }
#endif
}
